import React from "react";
import LandingLayout from "../components/layouts/Landing";
import AboutLayout from "../components/layouts/AboutLayout";
import Services from "../components/Services";
import { BsCheck } from "react-icons/bs";

export default function IndexPage() {
  return (
    <LandingLayout>
      <AboutLayout image="img/kendel_about.jpg" alignLeft={true}>
        <div className="py-4 px-2">
          <h2>ስለ እኛ</h2>
          <p>ቅንድል ዲጂታል መፅሔት በቅንድል ኢትዮጵያ የባለራዕይ ወጣቶች ተዘጋጅቶ በቅንድል ዲጂታል ሚዲያ እና በ E-square አድቨርታይዚንግ እና ኢቨንትስ የሚቀርብ በማህበራዊ ፣ ሀገራዊ ፣ ስነ ልቦናዊ ፣ ቴክኖሎጂ ፣ ባህል ፣ ጥበብና ጤና ነክ ጉዳዮች ዙሪያ የሚያተኩር ዲጂታል መፅሔት ነው፡፡ የካቲት 2011 ተቋቋመ።</p>
          <p>በዚህ የዲጂታል ዓለም ሰዎች እንደ ቀደሞው ግዜ እውቀትን፣ ምክንያታዊነትን እና ንቃትን ለመመርመር የግድ የቤተ -መጽሐፍትን በር ማንኳኳት አይጠበቅባቸውም ምክንያቱም ዛሬ ላይ የተለያዩ የቴክኖሎጂ ውጤቶች የሰውን ልጅ እውቀት፣ ምክንያታዊነት እና ብስለት የሚጨምሩ ከፍ ሲልም አዲስ የፈጠራ ችሎታን የሚያዳብሩ መጣጥፎችን በቀላሉ ማድረስ እንዲችሉ ተደርገው ተሰርተዋል፡፡ በዚህም ቅንድል ዲጂታል መጽሔት እስከዛሬ ካሉት የመጽሄት አይነቶች በአይነቱ ለየት በማለት በማህበራዊ ሚድያ፣ በዌብሳይት እና በሞባይል መተግበርያ ሰዎች በየትኛውም ጊዜና ቦታ ሆነው በዲጂታል ቴክኖሎጂ በመታገዝ በቀላሉ መረጃ እንዲያገኙ እና የንባብ ባህላቸውን እንዲያዳብሩ በበሰሉ ብዕረኞች የምትዘጋጅ በማህበራዊ፣ ሀገራዊ፣ ስነ-ልቦናዊ፣ ቴክኖሎጂ፣ ባህል፣ ጥበብና ጤና ነክ ጉዳዮች ዙሪያ የሚያተኩር ዲጂታል መፅሔት ነው፡፡ ቅንነትን ፣ ምክንያታዊነትን እና ሀገር ፍቅርን ከፍ ባለ ድምፅ እንሰብካለን፡፡</p>
        </div>
      </AboutLayout>
      <Services />
      <AboutLayout title="ራዕይ(Vision)" subTitle="በ2025 ዓ.ም በኢትዮጵያ ብሎም በምስራቅ አፍሪካ ቅንነትን የሚሰብክ ፣ ምክንያታዊነትን የሚያሰርፅ ፣ ሀገር ፍቅር ስሜትን የሚያቀጣጥል በተለያዩ የሀገር ውስጥና የውጭ ቋንቋዎች የሚሰራ እውቅና ያለው ትልቅ የሚዲያ ተቋም መገንባት ነው ፡፡" image="img/features-1.svg" alignLeft={true}>
        <div className="py-4 px-2" id="vision">
          <h2>የዲጂታል መፅሔቱ ጠቀሜታ</h2>
          <small><i>ዲጂታል መፅሔታችን የሚከተሉትን ጠቀሜታዎች ለሀገር ታበረክታለች ብለን እናምናለን፡፡</i></small><br />
          <p><i>በሀገራችን አሁን ላይ የሚታየውን የጥላቻ፣ የመጠላለፍ፣ የመናናቅ እና የመከፋፈል ጨለማን በይቅርታ፣ በፍቅር፣ በአንድነት፣ በመቻቻል፣ በመከባበር እና በሀገር አንድነት ብርሀን ድል ማድረግ እንደሚቻል ማህበረሰባችንን ታስተምራለች፡፡</i></p>
          <p><i>ወጣቶች በትምህርት ከሚያገኙት ሳይንሳዊ እውቀት እና ክህሎት በተጨማሪ የተሻጋሪ ትውልድ መለያ የሆኑትን ምክንያታዊነት፣ ቅንነትና ሀገር ፍቅርን መርሀቸው እንዲያደረጉ ከማገዝ አልፎ በውይይት የሚያምኑ ወጣቶች መፍለቂያ እንዲሆኑ ያግዛል፡፡ የሀገራችን አንጋፋ እና ወጣት ምሁራን ልምዳቸውን እና እውቀታቸውን ለታናናሾቻቸው የሚያካፍሉበትን መድረክ በማመቻቸት ከፍተኛ አስተዋጾ ያበረክታል፡፡</i></p>
          <p><i>የአንድ ሀገር ስልጣኔ ከእውቀት ፣ ከምክንያታዊ አስተሳሰብ ፣ ከሀገር ፍቅር እና ኪነ-ጥበብ ይመነጫል ብለን ስለምናምን ቅንድል ዲጂታል መፅሔት የሀገራችንን ባህል ወግና ስርዓት በመላው የሀገሪቱ ክፍል ከማስተዋወቅ በዘለለ ለታዳጊ ወጣቶች እና ህጻናት በኪነ-ጥበብ ስራዎች ቅንነትን፣ ምክንያታዊነትንና ሀገር ፍቅርን ለማስረጽ ከፍተኛ ሚና ይኖረዋል፡፡</i></p>
        </div>
      </AboutLayout>
      <AboutLayout  image="img/features-2.svg" alignLeft={false}>
        <div className="py-4 px-2">
          <h3>ኩነቶች እና ተሞክሮዎቻችን</h3>
          <p><i>በሀገራችን ላይ የሚገኙ የታሪክ ስፍራዎችን እና የቱሪስት መስእቦችን ከተለያዩ ወጣቶች ጋር በመሆን የምንጎበኝበትን መንገድ ቢያንስ በዓመት ፫ ጊዜ በተቀናጀ መልኩ ማዘጋጀት ነዉ። ይህም ዝግጅት አዲሱ ትዉልድ ስለ ሀገሩ፣ ባህሉ፣ ወጉ እንዲያዉቅ በማድረግ የሀገር ፍቅሩን ከማሳደጉ ባሻገር የባህል ልዉዉጥን በማድረግ ሰዎች በመቻቻል እና በፍቅር አብሮ የሚኖሩበትን መንገድ ያሳድጋል።</i></p>
          <p><i>ረጅም የእግር ጉዞ(hiking) ክንዉኖችን በማዘጋጀት ላይ ትሰራለች። ከዚህም ቀደም በነበሩን ኩነቶች ዉጤታማነቱን ለመገንዘብ ችለናል። ከሀገራችን አራቱም ማዕዘናት የተለያየ ልምድ ፣ ሀይማኖት፣ ዘር እና ቋንቋ የተወጣጡ ወጣቶችን በቡድን በማሰባሰብ ረጅም የእግር ጉዞ ማድረግ ወጣቱ ይበልጥ እንዲተዋወቅ ፣ እንዲቀራረብ፣ ልምዱን እንዲለዋወጥ፣ ራዕይውን እንዲያጋራ እና ትስስር እንዲፈጥር አግዟል።</i></p>
        </div>
      </AboutLayout>
      <AboutLayout  image="img/features-3.svg" alignLeft={true}>
        <div className="py-4 px-2" id="values">
          <h3>እሴቶች (Values)</h3>
          <p><BsCheck size={25}/> ቅንነት</p>
          <p><BsCheck size={25}/> ምክንያታዊነት</p>
          <p><BsCheck size={25}/> ሀገር ወዳድነት</p>
          <p><BsCheck size={25}/> ተአማኝነት</p>
          <p><BsCheck size={25}/> ተጠያቂነት</p>
          <p><BsCheck size={25}/> አሳታፊነት</p>
          <p><BsCheck size={25}/> ውጤታማነት</p>
        </div>
      </AboutLayout>
      <AboutLayout  image="img/features-4.svg" alignLeft={false}>
        <div className="py-4 px-2" id="goals">
          <h3>የቅንድል ዲጂታል መፅሔት ግብ(Goals)</h3>
          <p><i>ቅንድል ዲጂታል መፅሔት በሀገራችን ብሎም በምስራቅ አፍሪካ የሚገኙ ወጣቶች በዘመናዊ እውቀት ፣ በራስ ባህልና ቋንቋ በጥበብ የተቀረፁ የቅንነት ፣ የምክንያታዊነት እና የባለ ራዕይ ትውልድ ምሳሌ እንዲሆኑ ማስቻል ፤ ብሎም የሚጠይቅ ፣ የሚመረምር ፣ የሚመዝን ትውልድ አፍርቶ ማየት ነው።</i></p>
        </div>
      </AboutLayout>
    </LandingLayout>
  );
}